In [2]:
import pandas as pd
from datasets  import load_dataset
import  matplotlib.pyplot   as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:


df_exercise = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, 40, 28],
    "city": ["London", "Paris", "Berlin", "Madrid", "Rome"]
}, index=["a", "b", "c", "d", "e"])

print(df_exercise)

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [6]:
df_exercise.loc['c']

name    Charlie
age          35
city     Berlin
Name: c, dtype: object

In [25]:
df_exercise.iloc[2]

name    Charlie
age          35
city     Berlin
Name: c, dtype: object

In [26]:
df_exercise

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [36]:
df_exercise.loc['b':'d', ['name']]

      name
b      Bob
c  Charlie
d    David

In [37]:
df_exercise.loc['a':'c', ['age']]

   age
a   25
b   30
c   35

In [38]:
df_exercise

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [39]:
df_exercise.loc['e', ['city']]

city    Rome
Name: e, dtype: object

In [45]:
df_exercise.iloc[[1],[2]]

    city
b  Paris

In [46]:
import pandas as pd

df_hard = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, 40, 28],
    "city": ["London", "Paris", "Berlin", "Madrid", "Rome"]
}, index=["a", "b", "c", "d", "e"])

print(df_hard)

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [51]:
df_hard.loc[df_hard['age'] > 30, ["name", 'city']]

      name    city
c  Charlie  Berlin
d    David  Madrid

In [52]:
df_hard

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [54]:
df_hard.iloc[0:2,1:3]

   age    city
a   25  London
b   30   Paris

In [59]:
df_hard.loc[: , 'name']

a      Alice
b        Bob
c    Charlie
d      David
e        Eva
Name: name, dtype: object

In [60]:
df_hard

      name  age    city
a    Alice   25  London
b      Bob   30   Paris
c  Charlie   35  Berlin
d    David   40  Madrid
e      Eva   28    Rome

In [65]:
df_hard.iloc[4:,1]

e    28
Name: age, dtype: int64

In [70]:
df_hard.loc[df_hard['name'].str.startswith(("C","D")), "city" ]

c    Berlin
d    Madrid
Name: city, dtype: object